---
layout: post
permalink: node/1818
ratings: 11
avgrate: 4.2727
user: themadman
real_name: "Madhu Menon"
user_since: 07 Feb 2000
avatar: "/images/pictures/picture-823.jpg"
article_count: 3
excerpt: "I tell ya', I get tired of scanning r&#233;sum&#233;s sometimes. Having seen thousands of them while hiring people, I can confidently tell you that the average employer spends only 30 seconds per r&#233;sum&#233;."
---
<p>I tell ya', I get tired of scanning r&#233;sum&#233;s sometimes. Having seen thousands of </p>them while hiring people, I can confidently tell you that the average employer </p>spends only 30 seconds per r&#233;sum&#233;. What does this mean? It means you only have </p>30 seconds to make the first cut. Since I see so many badly written r&#233;sum&#233;s and </p>since someone on the Evolt list posted a question about r&#233;sum&#233;s, here's my first </p>article. Follow these r&#233;sum&#233; tips and you'll improve your chances in the job hunt. </p></p><P></p>  Since the </p>  objective of a r&#233;sum&#233; is to get you a job interview, your r&#233;sum&#233; should keep </p>  shouting, "These are my skills, this is what I have accomplished, and this is </p>  how I can be an asset to your company". While no two r&#233;sum&#233;s can ever be alike, </p>  keep the following points in mind while creating your r&#233;sum&#233;. </p></p>  <h2>Don'ts</h2></p><ul></p>  <li>Don't include too many </p>    personal details. Exclude information irrelevant to your job such as: Parents' </p>    name: Your parents have nothing to do with your job. <br></p>    Family history: Employers are more interested in what you can do, not whether </p>    your father is with the government or if your sister is married. <br></p>    Height, weight, blood group, and health: Not required unless you are applying </p>    to be a fitness instructor. <br></p>    Nationality: Not required unless you're applying for a job abroad. <br></p>    Languages known: Once again, unless it's a job requirement, it's a waste of </p>    space. </li></p>   </p>  <li> Don't write volumes </p>    about the companies where you have worked previously. While it may be good </p>    to have worked at a reputed company, a half page description of the company's </p>    activities is hardly required. Your r&#233;sum&#233; should sell your skills, not your </p>    previous employer. However, do point the skills you acquired at your previous </p>    jobs.</p>    </li></p>  <li> Don't give details of </p>    more than the last three to four positions/ companies where you have worked. </p>    Omit the rest or put them in a section called "Other positions held". If you've </p>    got 15 years of experience, writing about your first job as a trainee is not </p>    required and only makes the r&#233;sum&#233; long. Recruiters who often have to look </p>    through tens and hundreds of r&#233;sum&#233;s may skip through your r&#233;sum&#233;, which is </p>    not what you want. </p>    </li></p>  <li>Don't give a long list </p>    of job responsibilities that you were entrusted with. Give results. Instead </p>    of writing, <q>In charge of training of employees in computer applications</q>, </p>    use, <q>Trained 35 employees to use Windows 95, Microsoft Word, and Microsoft </p>    Excel within 4 months</q>. This will help your potential employer assess you </p>    by what you have done and is more likely to get you an interview. A long list </p>    will also make your r&#233;sum&#233; excessively long. Most r&#233;sum&#233;s should be a maximum </p>    of 3 pages in length. </p>    </li></p>  <li> Don't - and this is a big DON'T - create "fill-in-the-blanks" types of r&#233;sum&#233; </p>    cover letters. Letters that have blanks for positions and company names like </p>    <q>Application for the position of _____</q> create the impression that you have </p>    been sending them out to plenty of companies, and can't be bothered to create </p>    a proper letter. </p>    </li></p>  <li> Don't ever write, <q>application </p>    for any suitable post</q> in your cover letter. If you can't decide where you </p>    will fit in, don't expect your potential employer to think of a position for </p>    you.</p>    </li></p>  <li>Don't photocopy r&#233;sum&#233;s </p>    and send them. Get proper prints (preferably on a laser printer). It is very </p>    easy to distinguish a photocopy from an original. The minor extra expense </p>    is well worth it as an investment in your future.</li></p>   </p>  <li>Don't, for heaven's sake, </p>    type out your r&#233;sum&#233; in all caps and with underlining. This is one sure way </p>    to destroy readability. For section headings, use a sans serif font in bold </p>    weight instead.</p>    </li></p>  <li>Don't mention salary </p>    information anywhere. This may put you out of the race at the application </p>    level itself. Remember that you have to get to that interview! If your expected </p>    salary is specifically asked, put it as <q>negotiable</q>. Don't include a detailed </p>    salary history either.</p>    </li></p>  <li>Don't include a photograph </p>    unless specifically asked for. Passport photos have a way of turning bright, </p>    cheerful people into sulky, grumpy, stone-faced people and the recruiter may </p>    form a negative impression of you before he/ she even meets you.</li></p></ul></p><h2>Do's</h2></p><ul></p>  <li> Do give your name and </p>    contact information at the very top of the page. This will get the rid of </p>    superfluous headings such as "Name" and "Contact Address". It also makes it </p>    more likely that the recruiter will remember your name.</p>    </li></p>  <li> Do focus on all your </p>    achievements in the past. Be sure to quantify everything you have done. Sentences </p>    such as <q>Reduced project expenditure by 20%</q> and <q>Increased sales in my region </p>    by 30% within 3 months</q> have more impact than merely <q>Overall charge of projects</q></p>    and <q>Handled sales in region</q>. They show that you have accomplished something </p>    instead of merely being involved in mundane activities. Employers want achievers </p>    so your r&#233;sum&#233; must tell them why they should hire you.</p>    </li></p>  <li> Do put in skills that </p>    are important to the job for which you are applying. For example, If you are </p>    applying for the post of secretary, skills such as knowledge of computers, </p>    shorthand, etc. are usually required. Once again, be specific. Use sentences </p>    such as <q>Thorough knowledge of MS Word and Excel</q>, <q>Typing speed of 60 WPM</q>, </p>    <q>5 years experience as Secretary to Director</q> to highlight your skills. Exclude </p>    information like <q>School cricket captain</q> unless it is relevant to the position.</p>    </li></p>  <li>Do use good quality paper for your r&#233;sum&#233;. Superior quality paper makes </p>    an excellent first impression and the cost hardly matters. Avoid old, yellowed </p>    paper and normal photocopying paper. Remember not to fold the r&#233;sum&#233; either. </p>    </li></p>  <li> Do write a proper covering </p>    letter to go with your r&#233;sum&#233;. A cover letter provides a short introduction </p>    of you, the position you're applying for, and the skills, qualifications, </p>    and experience you possess. Restrict it to half a page. Don't use clich&#233;s </p>    like <q>I am enclosing my r&#233;sum&#233; for your kind perusal and consideration</q>. Most </p>    recruiters will just skim over all that.</p>    </li></p>  <li> Do try and find out </p>    who will be reading your r&#233;sum&#233; and then address your cover letter to them. </p>    This will give your r&#233;sum&#233; a better chance of being read. If you don't know </p>    the person, call up the company, tell the person at the other end that you </p>    wish to send a job application and would like to know whom to address it to. </li></p>  <li>Do, and <em>please</em> </p>    follow this tip, proofread, proofread, and then proofread some more. Make </p>    sure you have a printed copy of your r&#233;sum&#233; and give it a thorough and careful </p>    read. Then look at it again after a couple of hours. Once you're satisfied </p>    that there is nothing wrong, give it to a friend and ask him/ her if everything </p>    looks right. Spelling and grammar mistakes show that you can't be bothered </p>    reading your r&#233;sum&#233; carefully. Some recruiters won't even call you for an </p>    interview if they find spelling mistakes. Don't create a negative impression </p>    at the beginning itself.</p>    </li></p>  <li>Do give your r&#233;sum&#233; a </p>    professional look. R&#233;sum&#233;s that are typewritten or printed on a 9-pin dot </p>    matrix printer don't really work well. If you don't have access to a laser </p>    or inkjet printer, go to a DTP bureau that will do it for you. Make sure that </p>    all section headings are clearly visible and the recruiter can quickly get </p>    to the section that he/ she wants to see.</p>    </li></p>  <li>Do create your own r&#233;sum&#233;. </p>    Don't merely copy someone else's and then change the information. R&#233;sum&#233;s </p>    should be different depending upon your qualifications and experience, the </p>    nature of the position, etc. A r&#233;sum&#233; that is suitable for someone else may </p>    be totally unsuitable for you. For example, for a person with 20 years experience </p>    in Administration, skills and achievements are more important than educational </p>    qualifications. For a software engineer with limited experience, however, </p>    education and technical knowledge are definitely more important.</p>    </li></p>  <li>Do go to a professional </p>    r&#233;sum&#233; service if you need help preparing a r&#233;sum&#233;. By this, I don't mean </p>    your corner typist or your neighbourhood DTP bureau. R&#233;sum&#233; professionals </p>    will ask you for your qualifications, skills, experience, etc. and then create </p>    a targeted r&#233;sum&#233; for you. Though they may cost more than the DTP fellow, </p>    they are usually worth it.</li></p></ul>